tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/core'

brew 'curl'
brew 'dateutils'
brew 'ffmpeg'
brew 'git'
brew 'gpg'
brew 'gh'
brew 'go'
brew 'gnu-tar'
brew 'jq'
brew 'mas'
brew 'python'
brew 'ruby'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'svn'
brew 'tldr'
brew 'wget'
brew 'youtube-dl'

brew 'macvim'
brew 'ripgrep'
brew 'ctags'
#brew 'ack'
#brew 'the_silver_searcher'
#brew 'vim'

cask '1password-cli'
cask 'dash'
cask 'docker'
cask 'droplr'
cask 'firefox'
cask 'font-cascadia-code'
cask 'font-fira-code'
cask 'font-ibm-plex'
cask 'font-jetbrains-mono'
cask 'font-mononoki'
cask 'font-source-code-pro'
cask 'google-chrome'
cask 'iina'
cask 'insomnia'
cask 'licecap'
cask 'numi'
cask 'mactex'
cask 'ngrok'
cask 'openemu'
cask 'plex-media-server'
cask 'poedit'
cask 'querious'
cask 'rar'
cask 'skype'
cask 'steam'
cask 'subtitles'
cask 'textmate'
cask 'texmacs'
cask 'tower'
cask 'transmission'
cask 'transmit4' # I still own a license. Will have to upgrade to 5 at some point.
cask 'tunnelbear'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

brew 'mailhog'
brew 'mysql@5.7'
brew 'nginx'
brew 'node'
brew 'pnpm'
brew 'node@12'
brew 'node@14'
brew 'node@16'
brew 'php'
brew 'php@7.4'

# These don't work on Apple Silicon at the moment.
#cask 'vagrant'
#cask 'virtualbox'

# Generate the following list with this command:
# mas list | sort -b -f -k2 | awk '{printf "mas "}{printf "\""}{for (i=2; i<NF; i++) printf $i " "}{printf "\""}{print ", id: " $1}' | sed 's/ ",/",/g'
mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Day One", id: 1055511498
mas "Deliveries", id: 290986013
mas "Developer", id: 640199958
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Patterns", id: 429449079
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Slack", id: 803453959
mas "Streaks", id: 1493327990
mas "Twitter", id: 1482454543
mas "Unsplash Wallpapers", id: 1284863847
mas "Xcode", id: 497799835

